<?php

namespace Database\Seeders;

use App\Models\RoadSignCategory;
use Illuminate\Database\Seeder;

class RoadSignCategorySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        RoadSignCategory::query()->delete();
        $rows = [

            [
                'title' => 'Նախազգուշացնող',
                'description' => 'Նախազգուշացնող նշաններըտեղեկացնում են ճանապարհի այն վտանգավոր տեղամասին մոտենալու մասին, որով երթևեկելիս (տեղաշարժվելիս) անհրաժեշտ է ձեռնարկել իրադրությանը համապատասխան միջոցներ'
            ],
            [
                'title' => 'Առավելության',
                'description' => 'Առավելության նշանները սահմանում են խաչմերուկներով, երթևեկելի մասերի փոխհատումներով կամ ճանապարհների նեղ հատվածներով անցման հերթականությունը'
            ],
            [
                'title' => 'Արգելող',
                'description' => 'Արգելող նշանները մտցնում կամ վերացնում են երթևեկության որոշակի սահմանափակումներ'
            ],
            [
                'title' => 'Թելադրող',
                'description' => 'Թելադրող նշանները ցույց են տալիս երթևեկության թույլատրելի ուղղությունները, նվազագույն արագությունը, ինչպես նաև հետիոտների և որոշ տրանսպորտային միջոցների վարորդների համար նախատեսում են երթևեկության ուղղությունները'
            ],
            [
                'title' => 'Հատուկ թելադրանքի',
                'description' => 'Հատուկ թելադրանքի նշանները մտցնում կամ վերացնում են երթևեկության որոշակի ռեժիմներ'
            ],
            [
                'title' => 'Տեղեկատվության',
                'description' => 'Տեղեկատվության նշանները տեղեկացնում են բնակավայրերի և այլ օբյեկտների տեղակայման, ինչպես նաև սահմանված կամ առաջարկվող երթևեկության ռեժիմների մասին'
            ],
            [
                'title' => 'Սպասարկման',
                'description' => 'Սպասարկման նշանները տեղեկացնում են համապատասխան օբյեկտների գտնվելու վայրի մասին'
            ],
            [
                'title' => 'Lրացուցիչ տեղեկատվության',
                'description' => 'Լրացուցիչ տեղեկատվության նշանները (ցուցանակները) ճշտում կամ սահմանափակում են այն նշանների ազդեցությունը, որոնց հետ կիրառվում են:'
            ],
        ];

        foreach ($rows as $row) {
            $category = new RoadSignCategory;
            $category->save();

            $category->translation()->create([
                'title' => $row['title'],
                'description' => $row['description'],
                'road_sign_category_id' => $category->id,
                'language_id' => 102
            ]);
        }
    }
}
